apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_uart.h
/* UART_SW_XON_INT_RAW : R/WTC/SS; bitpos: [9]; default: 0;
 * This interrupt raw bit turns to high level when receiver recevies Xon
 * char when uart_sw_flow_con_en is set to 1.
 */

#define UART_SW_XON_INT_RAW    (BIT(9))
#define UART_SW_XON_INT_RAW_M  (UART_SW_XON_INT_RAW_V << UART_SW_XON_INT_RAW_S)
#define UART_SW_XON_INT_RAW_V  0x00000001
#define UART_SW_XON_INT_RAW_S  9

/* UART_RXFIFO_TOUT_INT_RAW : R/WTC/SS; bitpos: [8]; default: 0;
 * This interrupt raw bit turns to high level when receiver takes more time
 * than rx_tout_thrhd to receive a byte.
 */

#define UART_RXFIFO_TOUT_INT_RAW    (BIT(8))
#define UART_RXFIFO_TOUT_INT_RAW_M  (UART_RXFIFO_TOUT_INT_RAW_V << UART_RXFIFO_TOUT_INT_RAW_S)
#define UART_RXFIFO_TOUT_INT_RAW_V  0x00000001
#define UART_RXFIFO_TOUT_INT_RAW_S  8

/* UART_BRK_DET_INT_RAW : R/WTC/SS; bitpos: [7]; default: 0;
 * This interrupt raw bit turns to high level when receiver detects a 0
 * after the stop bit.
 */

#define UART_BRK_DET_INT_RAW    (BIT(7))
#define UART_BRK_DET_INT_RAW_M  (UART_BRK_DET_INT_RAW_V << UART_BRK_DET_INT_RAW_S)
#define UART_BRK_DET_INT_RAW_V  0x00000001
#define UART_BRK_DET_INT_RAW_S  7

/* UART_CTS_CHG_INT_RAW : R/WTC/SS; bitpos: [6]; default: 0;
 * This interrupt raw bit turns to high level when receiver detects the edge
 * change of CTSn signal.
 */

#define UART_CTS_CHG_INT_RAW    (BIT(6))
#define UART_CTS_CHG_INT_RAW_M  (UART_CTS_CHG_INT_RAW_V << UART_CTS_CHG_INT_RAW_S)
#define UART_CTS_CHG_INT_RAW_V  0x00000001
#define UART_CTS_CHG_INT_RAW_S  6

/* UART_DSR_CHG_INT_RAW : R/WTC/SS; bitpos: [5]; default: 0;
 * This interrupt raw bit turns to high level when receiver detects the edge
 * change of DSRn signal.
 */

#define UART_DSR_CHG_INT_RAW    (BIT(5))
#define UART_DSR_CHG_INT_RAW_M  (UART_DSR_CHG_INT_RAW_V << UART_DSR_CHG_INT_RAW_S)
#define UART_DSR_CHG_INT_RAW_V  0x00000001
#define UART_DSR_CHG_INT_RAW_S  5

/* UART_RXFIFO_OVF_INT_RAW : R/WTC/SS; bitpos: [4]; default: 0;
 * This interrupt raw bit turns to high level when receiver receives more
 * data than the FIFO can store.
 */

#define UART_RXFIFO_OVF_INT_RAW    (BIT(4))
#define UART_RXFIFO_OVF_INT_RAW_M  (UART_RXFIFO_OVF_INT_RAW_V << UART_RXFIFO_OVF_INT_RAW_S)
#define UART_RXFIFO_OVF_INT_RAW_V  0x00000001
#define UART_RXFIFO_OVF_INT_RAW_S  4

/* UART_FRM_ERR_INT_RAW : R/WTC/SS; bitpos: [3]; default: 0;
 * This interrupt raw bit turns to high level when receiver detects a data
 * frame error .
 */

#define UART_FRM_ERR_INT_RAW    (BIT(3))
#define UART_FRM_ERR_INT_RAW_M  (UART_FRM_ERR_INT_RAW_V << UART_FRM_ERR_INT_RAW_S)
#define UART_FRM_ERR_INT_RAW_V  0x00000001
#define UART_FRM_ERR_INT_RAW_S  3

/* UART_PARITY_ERR_INT_RAW : R/WTC/SS; bitpos: [2]; default: 0;
 * This interrupt raw bit turns to high level when receiver detects a parity
 * error in the data.
 */

#define UART_PARITY_ERR_INT_RAW    (BIT(2))
#define UART_PARITY_ERR_INT_RAW_M  (UART_PARITY_ERR_INT_RAW_V << UART_PARITY_ERR_INT_RAW_S)
#define UART_PARITY_ERR_INT_RAW_V  0x00000001
#define UART_PARITY_ERR_INT_RAW_S  2

/* UART_TXFIFO_EMPTY_INT_RAW : R/WTC/SS; bitpos: [1]; default: 1;
 * This interrupt raw bit turns to high level when the amount of data in
 * Tx-FIFO is less than what txfifo_empty_thrhd specifies .
 */

#define UART_TXFIFO_EMPTY_INT_RAW    (BIT(1))
#define UART_TXFIFO_EMPTY_INT_RAW_M  (UART_TXFIFO_EMPTY_INT_RAW_V << UART_TXFIFO_EMPTY_INT_RAW_S)
#define UART_TXFIFO_EMPTY_INT_RAW_V  0x00000001
#define UART_TXFIFO_EMPTY_INT_RAW_S  1

/* UART_RXFIFO_FULL_INT_RAW : R/WTC/SS; bitpos: [0]; default: 0;
 * This interrupt raw bit turns to high level when receiver receives more
 * data than what rxfifo_full_thrhd specifies.
 */

#define UART_RXFIFO_FULL_INT_RAW    (BIT(0))
#define UART_RXFIFO_FULL_INT_RAW_M  (UART_RXFIFO_FULL_INT_RAW_V << UART_RXFIFO_FULL_INT_RAW_S)
#define UART_RXFIFO_FULL_INT_RAW_V  0x00000001
#define UART_RXFIFO_FULL_INT_RAW_S  0

/* UART_INT_ST_REG register
 * Masked interrupt status
 */

#define UART_INT_ST_REG(i) (REG_UART_BASE(i) + 0x8)

/* UART_WAKEUP_INT_ST : RO; bitpos: [19]; default: 0;
 * This is the status bit for uart_wakeup_int_raw when uart_wakeup_int_ena
 * is set to 1.
 */

#define UART_WAKEUP_INT_ST    (BIT(19))
#define UART_WAKEUP_INT_ST_M  (UART_WAKEUP_INT_ST_V << UART_WAKEUP_INT_ST_S)
#define UART_WAKEUP_INT_ST_V  0x00000001
#define UART_WAKEUP_INT_ST_S  19

/* UART_AT_CMD_CHAR_DET_INT_ST : RO; bitpos: [18]; default: 0;
 * This is the status bit for at_cmd_det_int_raw when
 * at_cmd_char_det_int_ena is set to 1.
 */

#define UART_AT_CMD_CHAR_DET_INT_ST    (BIT(18))
#define UART_AT_CMD_CHAR_DET_INT_ST_M  (UART_AT_CMD_CHAR_DET_INT_ST_V << UART_AT_CMD_CHAR_DET_INT_ST_S)
#define UART_AT_CMD_CHAR_DET_INT_ST_V  0x00000001
#define UART_AT_CMD_CHAR_DET_INT_ST_S  18

/* UART_RS485_CLASH_INT_ST : RO; bitpos: [17]; default: 0;
 * This is the status bit for rs485_clash_int_raw when rs485_clash_int_ena
 * is set to 1.
 */

#define UART_RS485_CLASH_INT_ST    (BIT(17))
#define UART_RS485_CLASH_INT_ST_M  (UART_RS485_CLASH_INT_ST_V << UART_RS485_CLASH_INT_ST_S)
#define UART_RS485_CLASH_INT_ST_V  0x00000001
#define UART_RS485_CLASH_INT_ST_S  17

/* UART_RS485_FRM_ERR_INT_ST : RO; bitpos: [16]; default: 0;
 * This is the status bit for rs485_frm_err_int_raw when
 * rs485_fm_err_int_ena is set to 1.
 */

#define UART_RS485_FRM_ERR_INT_ST    (BIT(16))
#define UART_RS485_FRM_ERR_INT_ST_M  (UART_RS485_FRM_ERR_INT_ST_V << UART_RS485_FRM_ERR_INT_ST_S)
#define UART_RS485_FRM_ERR_INT_ST_V  0x00000001
#define UART_RS485_FRM_ERR_INT_ST_S  16

/* UART_RS485_PARITY_ERR_INT_ST : RO; bitpos: [15]; default: 0;
 * This is the status bit for rs485_parity_err_int_raw when
 * rs485_parity_int_ena is set to 1.
 */

#define UART_RS485_PARITY_ERR_INT_ST    (BIT(15))
#define UART_RS485_PARITY_ERR_INT_ST_M  (UART_RS485_PARITY_ERR_INT_ST_V << UART_RS485_PARITY_ERR_INT_ST_S)
#define UART_RS485_PARITY_ERR_INT_ST_V  0x00000001
#define UART_RS485_PARITY_ERR_INT_ST_S  15

/* UART_TX_DONE_INT_ST : RO; bitpos: [14]; default: 0;
 * This is the status bit for tx_done_int_raw when tx_done_int_ena is set to
 * 1.
 */

#define UART_TX_DONE_INT_ST    (BIT(14))
#define UART_TX_DONE_INT_ST_M  (UART_TX_DONE_INT_ST_V << UART_TX_DONE_INT_ST_S)
#define UART_TX_DONE_INT_ST_V  0x00000001
#define UART_TX_DONE_INT_ST_S  14

