apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_uart.h
/* UART_RS485_PARITY_ERR_INT_CLR : WT; bitpos: [15]; default: 0;
 * Set this bit to clear the rs485_parity_err_int_raw interrupt.
 */

#define UART_RS485_PARITY_ERR_INT_CLR    (BIT(15))
#define UART_RS485_PARITY_ERR_INT_CLR_M  (UART_RS485_PARITY_ERR_INT_CLR_V << UART_RS485_PARITY_ERR_INT_CLR_S)
#define UART_RS485_PARITY_ERR_INT_CLR_V  0x00000001
#define UART_RS485_PARITY_ERR_INT_CLR_S  15

/* UART_TX_DONE_INT_CLR : WT; bitpos: [14]; default: 0;
 * Set this bit to clear the tx_done_int_raw interrupt.
 */

#define UART_TX_DONE_INT_CLR    (BIT(14))
#define UART_TX_DONE_INT_CLR_M  (UART_TX_DONE_INT_CLR_V << UART_TX_DONE_INT_CLR_S)
#define UART_TX_DONE_INT_CLR_V  0x00000001
#define UART_TX_DONE_INT_CLR_S  14

/* UART_TX_BRK_IDLE_DONE_INT_CLR : WT; bitpos: [13]; default: 0;
 * Set this bit to clear the tx_brk_idle_done_int_raw interrupt.
 */

#define UART_TX_BRK_IDLE_DONE_INT_CLR    (BIT(13))
#define UART_TX_BRK_IDLE_DONE_INT_CLR_M  (UART_TX_BRK_IDLE_DONE_INT_CLR_V << UART_TX_BRK_IDLE_DONE_INT_CLR_S)
#define UART_TX_BRK_IDLE_DONE_INT_CLR_V  0x00000001
#define UART_TX_BRK_IDLE_DONE_INT_CLR_S  13

/* UART_TX_BRK_DONE_INT_CLR : WT; bitpos: [12]; default: 0;
 * Set this bit to clear the tx_brk_done_int_raw interrupt..
 */

#define UART_TX_BRK_DONE_INT_CLR    (BIT(12))
#define UART_TX_BRK_DONE_INT_CLR_M  (UART_TX_BRK_DONE_INT_CLR_V << UART_TX_BRK_DONE_INT_CLR_S)
#define UART_TX_BRK_DONE_INT_CLR_V  0x00000001
#define UART_TX_BRK_DONE_INT_CLR_S  12

/* UART_GLITCH_DET_INT_CLR : WT; bitpos: [11]; default: 0;
 * Set this bit to clear the glitch_det_int_raw interrupt.
 */

#define UART_GLITCH_DET_INT_CLR    (BIT(11))
#define UART_GLITCH_DET_INT_CLR_M  (UART_GLITCH_DET_INT_CLR_V << UART_GLITCH_DET_INT_CLR_S)
#define UART_GLITCH_DET_INT_CLR_V  0x00000001
#define UART_GLITCH_DET_INT_CLR_S  11

/* UART_SW_XOFF_INT_CLR : WT; bitpos: [10]; default: 0;
 * Set this bit to clear the sw_xoff_int_raw interrupt.
 */

#define UART_SW_XOFF_INT_CLR    (BIT(10))
#define UART_SW_XOFF_INT_CLR_M  (UART_SW_XOFF_INT_CLR_V << UART_SW_XOFF_INT_CLR_S)
#define UART_SW_XOFF_INT_CLR_V  0x00000001
#define UART_SW_XOFF_INT_CLR_S  10

/* UART_SW_XON_INT_CLR : WT; bitpos: [9]; default: 0;
 * Set this bit to clear the sw_xon_int_raw interrupt.
 */

#define UART_SW_XON_INT_CLR    (BIT(9))
#define UART_SW_XON_INT_CLR_M  (UART_SW_XON_INT_CLR_V << UART_SW_XON_INT_CLR_S)
#define UART_SW_XON_INT_CLR_V  0x00000001
#define UART_SW_XON_INT_CLR_S  9

/* UART_RXFIFO_TOUT_INT_CLR : WT; bitpos: [8]; default: 0;
 * Set this bit to clear the rxfifo_tout_int_raw interrupt.
 */

#define UART_RXFIFO_TOUT_INT_CLR    (BIT(8))
#define UART_RXFIFO_TOUT_INT_CLR_M  (UART_RXFIFO_TOUT_INT_CLR_V << UART_RXFIFO_TOUT_INT_CLR_S)
#define UART_RXFIFO_TOUT_INT_CLR_V  0x00000001
#define UART_RXFIFO_TOUT_INT_CLR_S  8

/* UART_BRK_DET_INT_CLR : WT; bitpos: [7]; default: 0;
 * Set this bit to clear the brk_det_int_raw interrupt.
 */

#define UART_BRK_DET_INT_CLR    (BIT(7))
#define UART_BRK_DET_INT_CLR_M  (UART_BRK_DET_INT_CLR_V << UART_BRK_DET_INT_CLR_S)
#define UART_BRK_DET_INT_CLR_V  0x00000001
#define UART_BRK_DET_INT_CLR_S  7

/* UART_CTS_CHG_INT_CLR : WT; bitpos: [6]; default: 0;
 * Set this bit to clear the cts_chg_int_raw interrupt.
 */

#define UART_CTS_CHG_INT_CLR    (BIT(6))
#define UART_CTS_CHG_INT_CLR_M  (UART_CTS_CHG_INT_CLR_V << UART_CTS_CHG_INT_CLR_S)
#define UART_CTS_CHG_INT_CLR_V  0x00000001
#define UART_CTS_CHG_INT_CLR_S  6

/* UART_DSR_CHG_INT_CLR : WT; bitpos: [5]; default: 0;
 * Set this bit to clear the dsr_chg_int_raw interrupt.
 */

#define UART_DSR_CHG_INT_CLR    (BIT(5))
#define UART_DSR_CHG_INT_CLR_M  (UART_DSR_CHG_INT_CLR_V << UART_DSR_CHG_INT_CLR_S)
#define UART_DSR_CHG_INT_CLR_V  0x00000001
#define UART_DSR_CHG_INT_CLR_S  5

/* UART_RXFIFO_OVF_INT_CLR : WT; bitpos: [4]; default: 0;
 * Set this bit to clear rxfifo_ovf_int_raw interrupt.
 */

#define UART_RXFIFO_OVF_INT_CLR    (BIT(4))
#define UART_RXFIFO_OVF_INT_CLR_M  (UART_RXFIFO_OVF_INT_CLR_V << UART_RXFIFO_OVF_INT_CLR_S)
#define UART_RXFIFO_OVF_INT_CLR_V  0x00000001
#define UART_RXFIFO_OVF_INT_CLR_S  4

/* UART_FRM_ERR_INT_CLR : WT; bitpos: [3]; default: 0;
 * Set this bit to clear frm_err_int_raw interrupt.
 */

#define UART_FRM_ERR_INT_CLR    (BIT(3))
#define UART_FRM_ERR_INT_CLR_M  (UART_FRM_ERR_INT_CLR_V << UART_FRM_ERR_INT_CLR_S)
#define UART_FRM_ERR_INT_CLR_V  0x00000001
#define UART_FRM_ERR_INT_CLR_S  3

/* UART_PARITY_ERR_INT_CLR : WT; bitpos: [2]; default: 0;
 * Set this bit to clear parity_err_int_raw interrupt.
 */

#define UART_PARITY_ERR_INT_CLR    (BIT(2))
#define UART_PARITY_ERR_INT_CLR_M  (UART_PARITY_ERR_INT_CLR_V << UART_PARITY_ERR_INT_CLR_S)
#define UART_PARITY_ERR_INT_CLR_V  0x00000001
#define UART_PARITY_ERR_INT_CLR_S  2

/* UART_TXFIFO_EMPTY_INT_CLR : WT; bitpos: [1]; default: 0;
 * Set this bit to clear txfifo_empty_int_raw interrupt.
 */

#define UART_TXFIFO_EMPTY_INT_CLR    (BIT(1))
#define UART_TXFIFO_EMPTY_INT_CLR_M  (UART_TXFIFO_EMPTY_INT_CLR_V << UART_TXFIFO_EMPTY_INT_CLR_S)
#define UART_TXFIFO_EMPTY_INT_CLR_V  0x00000001
#define UART_TXFIFO_EMPTY_INT_CLR_S  1

/* UART_INT_CLR_REG register
 *  Interrupt clear bits
 */

#define UART_INT_CLR_REG(i) (REG_UART_BASE(i) + 0x10)

/* UART_RXFIFO_FULL_INT_CLR : WT; bitpos: [0]; default: 0;
 * Set this bit to clear the rxfifo_full_int_raw interrupt.
 */

#define UART_RXFIFO_FULL_INT_CLR    (BIT(0))
#define UART_RXFIFO_FULL_INT_CLR_M  (UART_RXFIFO_FULL_INT_CLR_V << UART_RXFIFO_FULL_INT_CLR_S)
#define UART_RXFIFO_FULL_INT_CLR_V  0x00000001
#define UART_RXFIFO_FULL_INT_CLR_S  0

/* UART_CLKDIV_REG register
 * Clock divider configuration
 */

#define UART_CLKDIV_REG(i) (REG_UART_BASE(i) + 0x14)

/* UART_CLKDIV_FRAG : R/W; bitpos: [23:20]; default: 0;
 * The decimal part of the frequency divider factor.
 */

#define UART_CLKDIV_FRAG    0x0000000f
#define UART_CLKDIV_FRAG_M  (UART_CLKDIV_FRAG_V << UART_CLKDIV_FRAG_S)
#define UART_CLKDIV_FRAG_V  0x0000000f
#define UART_CLKDIV_FRAG_S  20

/* Configuration Register */

/* UART_CLKDIV : R/W; bitpos: [11:0]; default: 694;
 * The integral part of the frequency divider factor.
 */

#define UART_CLKDIV    0x00000fff
#define UART_CLKDIV_M  (UART_CLKDIV_V << UART_CLKDIV_S)
#define UART_CLKDIV_V  0x00000fff
#define UART_CLKDIV_S  0

/* UART_RX_FILT_REG register
 * Rx Filter configuration
 */

#define UART_RX_FILT_REG (DR_REG_UART_BASE + 0x18)

/* UART_GLITCH_FILT_EN : R/W; bitpos: [8]; default: 0;
 * Set this bit to enable Rx signal filter.
 */

