apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_uart.h
/* UART_TX_FLOW_EN : R/W; bitpos: [15]; default: 0;
 * Set this bit to enable flow control function for transmitter.
 */

#define UART_TX_FLOW_EN    (BIT(15))
#define UART_TX_FLOW_EN_M  (UART_TX_FLOW_EN_V << UART_TX_FLOW_EN_S)
#define UART_TX_FLOW_EN_V  0x00000001
#define UART_TX_FLOW_EN_S  15

/* UART_LOOPBACK : R/W; bitpos: [14]; default: 0;
 * Set this bit to enable uart loopback test mode.
 */

#define UART_LOOPBACK    (BIT(14))
#define UART_LOOPBACK_M  (UART_LOOPBACK_V << UART_LOOPBACK_S)
#define UART_LOOPBACK_V  0x00000001
#define UART_LOOPBACK_S  14

/* UART_IRDA_RX_INV : R/W; bitpos: [13]; default: 0;
 * Set this bit to invert the level of IrDA receiver.
 */

#define UART_IRDA_RX_INV    (BIT(13))
#define UART_IRDA_RX_INV_M  (UART_IRDA_RX_INV_V << UART_IRDA_RX_INV_S)
#define UART_IRDA_RX_INV_V  0x00000001
#define UART_IRDA_RX_INV_S  13

/* UART_IRDA_TX_INV : R/W; bitpos: [12]; default: 0;
 * Set this bit to invert the level of  IrDA transmitter.
 */

#define UART_IRDA_TX_INV    (BIT(12))
#define UART_IRDA_TX_INV_M  (UART_IRDA_TX_INV_V << UART_IRDA_TX_INV_S)
#define UART_IRDA_TX_INV_V  0x00000001
#define UART_IRDA_TX_INV_S  12

/* UART_IRDA_WCTL : R/W; bitpos: [11]; default: 0;
 * 1'h1: The IrDA transmitter's 11th bit is the same as 10th bit. 1'h0: Set
 * IrDA transmitter's 11th bit to 0.
 */

#define UART_IRDA_WCTL    (BIT(11))
#define UART_IRDA_WCTL_M  (UART_IRDA_WCTL_V << UART_IRDA_WCTL_S)
#define UART_IRDA_WCTL_V  0x00000001
#define UART_IRDA_WCTL_S  11

/* UART_IRDA_TX_EN : R/W; bitpos: [10]; default: 0;
 * This is the start enable bit for IrDA transmitter.
 */

#define UART_IRDA_TX_EN    (BIT(10))
#define UART_IRDA_TX_EN_M  (UART_IRDA_TX_EN_V << UART_IRDA_TX_EN_S)
#define UART_IRDA_TX_EN_V  0x00000001
#define UART_IRDA_TX_EN_S  10

/* UART_IRDA_DPLX : R/W; bitpos: [9]; default: 0;
 * Set this bit to enable IrDA loopback mode.
 */

#define UART_IRDA_DPLX    (BIT(9))
#define UART_IRDA_DPLX_M  (UART_IRDA_DPLX_V << UART_IRDA_DPLX_S)
#define UART_IRDA_DPLX_V  0x00000001
#define UART_IRDA_DPLX_S  9

/* UART_TXD_BRK : R/W; bitpos: [8]; default: 0;
 * Set this bit to enbale transmitter to  send NULL when the process of
 * sending data is done.
 */

#define UART_TXD_BRK    (BIT(8))
#define UART_TXD_BRK_M  (UART_TXD_BRK_V << UART_TXD_BRK_S)
#define UART_TXD_BRK_V  0x00000001
#define UART_TXD_BRK_S  8

/* UART_SW_DTR : R/W; bitpos: [7]; default: 0;
 * This register is used to configure the software dtr signal which is used
 * in software flow control.
 */

#define UART_SW_DTR    (BIT(7))
#define UART_SW_DTR_M  (UART_SW_DTR_V << UART_SW_DTR_S)
#define UART_SW_DTR_V  0x00000001
#define UART_SW_DTR_S  7

/* UART_SW_RTS : R/W; bitpos: [6]; default: 0;
 * This register is used to configure the software rts signal which is used
 * in software flow control.
 */

#define UART_SW_RTS    (BIT(6))
#define UART_SW_RTS_M  (UART_SW_RTS_V << UART_SW_RTS_S)
#define UART_SW_RTS_V  0x00000001
#define UART_SW_RTS_S  6

/* UART_STOP_BIT_NUM : R/W; bitpos: [5:4]; default: 1;
 * This register is used to set the length of  stop bit.
 */

#define UART_STOP_BIT_NUM    0x00000003
#define UART_STOP_BIT_NUM_M  (UART_STOP_BIT_NUM_V << UART_STOP_BIT_NUM_S)
#define UART_STOP_BIT_NUM_V  0x00000003
#define UART_STOP_BIT_NUM_S  4

/* UART_BIT_NUM : R/W; bitpos: [3:2]; default: 3;
 * This register is used to set the length of data.
 */

#define UART_BIT_NUM    0x00000003
#define UART_BIT_NUM_M  (UART_BIT_NUM_V << UART_BIT_NUM_S)
#define UART_BIT_NUM_V  0x00000003
#define UART_BIT_NUM_S  2

/* UART_PARITY_EN : R/W; bitpos: [1]; default: 0;
 * Set this bit to enable uart parity check.
 */

#define UART_PARITY_EN    (BIT(1))
#define UART_PARITY_EN_M  (UART_PARITY_EN_V << UART_PARITY_EN_S)
#define UART_PARITY_EN_V  0x00000001
#define UART_PARITY_EN_S  1

/* UART_PARITY : R/W; bitpos: [0]; default: 0;
 * This register is used to configure the parity check mode.
 */

#define UART_PARITY    (BIT(0))
#define UART_PARITY_M  (UART_PARITY_V << UART_PARITY_S)
#define UART_PARITY_V  0x00000001
#define UART_PARITY_S  0

/* UART_CONF1_REG register
 * Configuration register 1
 */

#define UART_CONF1_REG(i) (REG_UART_BASE(i) + 0x24)

/* UART_RX_TOUT_EN : R/W; bitpos: [23]; default: 0;
 * This is the enble bit for uart receiver's timeout function.
 */

#define UART_RX_TOUT_EN    (BIT(23))
#define UART_RX_TOUT_EN_M  (UART_RX_TOUT_EN_V << UART_RX_TOUT_EN_S)
#define UART_RX_TOUT_EN_V  0x00000001
#define UART_RX_TOUT_EN_S  23

/* UART_RX_FLOW_EN : R/W; bitpos: [22]; default: 0;
 * This is the flow enable bit for UART receiver.
 */

#define UART_RX_FLOW_EN    (BIT(22))
#define UART_RX_FLOW_EN_M  (UART_RX_FLOW_EN_V << UART_RX_FLOW_EN_S)
#define UART_RX_FLOW_EN_V  0x00000001
#define UART_RX_FLOW_EN_S  22

/* UART_RX_TOUT_FLOW_DIS : R/W; bitpos: [21]; default: 0;
 * Set this bit to stop accumulating idle_cnt when hardware flow control
 * works.
 */

#define UART_RX_TOUT_FLOW_DIS    (BIT(21))
#define UART_RX_TOUT_FLOW_DIS_M  (UART_RX_TOUT_FLOW_DIS_V << UART_RX_TOUT_FLOW_DIS_S)
#define UART_RX_TOUT_FLOW_DIS_V  0x00000001
#define UART_RX_TOUT_FLOW_DIS_S  21

/* UART_DIS_RX_DAT_OVF : R/W; bitpos: [20]; default: 0;
 * Disable UART Rx data overflow detect.
 */

#define UART_DIS_RX_DAT_OVF    (BIT(20))
#define UART_DIS_RX_DAT_OVF_M  (UART_DIS_RX_DAT_OVF_V << UART_DIS_RX_DAT_OVF_S)
#define UART_DIS_RX_DAT_OVF_V  0x00000001
#define UART_DIS_RX_DAT_OVF_S  20

/* UART_TXFIFO_EMPTY_THRHD : R/W; bitpos: [19:10]; default: 96;
 * It will produce txfifo_empty_int interrupt when the data amount in
 * Tx-FIFO is less than this register value.
 */

#define UART_TXFIFO_EMPTY_THRHD    0x000003ff
#define UART_TXFIFO_EMPTY_THRHD_M  (UART_TXFIFO_EMPTY_THRHD_V << UART_TXFIFO_EMPTY_THRHD_S)
#define UART_TXFIFO_EMPTY_THRHD_V  0x000003ff
#define UART_TXFIFO_EMPTY_THRHD_S  10

/* UART_RXFIFO_FULL_THRHD : R/W; bitpos: [9:0]; default: 96;
 * It will produce rxfifo_full_int interrupt when receiver receives more
 * data than this register value.
 */

#define UART_RXFIFO_FULL_THRHD    0x000003ff
#define UART_RXFIFO_FULL_THRHD_M  (UART_RXFIFO_FULL_THRHD_V << UART_RXFIFO_FULL_THRHD_S)
#define UART_RXFIFO_FULL_THRHD_V  0x000003ff
#define UART_RXFIFO_FULL_THRHD_S  0

/* UART_LOWPULSE_REG register
 * Autobaud minimum low pulse duration register
 */

