apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_uart.h
#define UART_LOWPULSE_REG (DR_REG_UART_BASE + 0x28)

/* UART_LOWPULSE_MIN_CNT : RO; bitpos: [11:0]; default: 4095;
 * This register stores the value of the minimum duration time of the low
 * level pulse. It is used in baud rate-detect process.
 */

#define UART_LOWPULSE_MIN_CNT    0x00000fff
#define UART_LOWPULSE_MIN_CNT_M  (UART_LOWPULSE_MIN_CNT_V << UART_LOWPULSE_MIN_CNT_S)
#define UART_LOWPULSE_MIN_CNT_V  0x00000fff
#define UART_LOWPULSE_MIN_CNT_S  0

/* UART_HIGHPULSE_REG register
 * Autobaud minimum high pulse duration register
 */

#define UART_HIGHPULSE_REG (DR_REG_UART_BASE + 0x2c)

/* UART_HIGHPULSE_MIN_CNT : RO; bitpos: [11:0]; default: 4095;
 * This register stores  the value of the maxinum duration time for the high
 * level pulse. It is used in baud rate-detect process.
 */

#define UART_HIGHPULSE_MIN_CNT    0x00000fff
#define UART_HIGHPULSE_MIN_CNT_M  (UART_HIGHPULSE_MIN_CNT_V << UART_HIGHPULSE_MIN_CNT_S)
#define UART_HIGHPULSE_MIN_CNT_V  0x00000fff
#define UART_HIGHPULSE_MIN_CNT_S  0

/* UART_RXD_CNT_REG register
 * Autobaud edge change count register
 */

#define UART_RXD_CNT_REG (DR_REG_UART_BASE + 0x30)

/* UART_RXD_EDGE_CNT : RO; bitpos: [9:0]; default: 0;
 * This register stores the count of rxd edge change. It is used in baud
 * rate-detect process.
 */

#define UART_RXD_EDGE_CNT    0x000003ff
#define UART_RXD_EDGE_CNT_M  (UART_RXD_EDGE_CNT_V << UART_RXD_EDGE_CNT_S)
#define UART_RXD_EDGE_CNT_V  0x000003ff
#define UART_RXD_EDGE_CNT_S  0

/* UART_FLOW_CONF_REG register
 * Software flow-control configuration
 */

#define UART_FLOW_CONF_REG (DR_REG_UART_BASE + 0x34)

/* UART_SEND_XOFF : R/W/SS/SC; bitpos: [5]; default: 0;
 * Set this bit to send Xoff char. It is cleared by hardware automatically.
 */

#define UART_SEND_XOFF    (BIT(5))
#define UART_SEND_XOFF_M  (UART_SEND_XOFF_V << UART_SEND_XOFF_S)
#define UART_SEND_XOFF_V  0x00000001
#define UART_SEND_XOFF_S  5

/* UART_SEND_XON : R/W/SS/SC; bitpos: [4]; default: 0;
 * Set this bit to send Xon char. It is cleared by hardware automatically.
 */

#define UART_SEND_XON    (BIT(4))
#define UART_SEND_XON_M  (UART_SEND_XON_V << UART_SEND_XON_S)
#define UART_SEND_XON_V  0x00000001
#define UART_SEND_XON_S  4

/* UART_FORCE_XOFF : R/W; bitpos: [3]; default: 0;
 * Set this bit to stop the  transmitter from sending data.
 */

#define UART_FORCE_XOFF    (BIT(3))
#define UART_FORCE_XOFF_M  (UART_FORCE_XOFF_V << UART_FORCE_XOFF_S)
#define UART_FORCE_XOFF_V  0x00000001
#define UART_FORCE_XOFF_S  3

/* UART_FORCE_XON : R/W; bitpos: [2]; default: 0;
 * Set this bit to enable the transmitter to go on sending data.
 */

#define UART_FORCE_XON    (BIT(2))
#define UART_FORCE_XON_M  (UART_FORCE_XON_V << UART_FORCE_XON_S)
#define UART_FORCE_XON_V  0x00000001
#define UART_FORCE_XON_S  2

/* UART_XONOFF_DEL : R/W; bitpos: [1]; default: 0;
 * Set this bit to remove flow control char from the received data.
 */

#define UART_XONOFF_DEL    (BIT(1))
#define UART_XONOFF_DEL_M  (UART_XONOFF_DEL_V << UART_XONOFF_DEL_S)
#define UART_XONOFF_DEL_V  0x00000001
#define UART_XONOFF_DEL_S  1

/* UART_SW_FLOW_CON_EN : R/W; bitpos: [0]; default: 0;
 * Set this bit to enable software flow control. It is used with register
 * sw_xon or sw_xoff.
 */

#define UART_SW_FLOW_CON_EN    (BIT(0))
#define UART_SW_FLOW_CON_EN_M  (UART_SW_FLOW_CON_EN_V << UART_SW_FLOW_CON_EN_S)
#define UART_SW_FLOW_CON_EN_V  0x00000001
#define UART_SW_FLOW_CON_EN_S  0

/* UART_SLEEP_CONF_REG register
 * Sleep-mode configuration
 */

#define UART_SLEEP_CONF_REG (DR_REG_UART_BASE + 0x38)

/* UART_ACTIVE_THRESHOLD : R/W; bitpos: [9:0]; default: 240;
 * The uart is activated from light sleeping mode when the input rxd edge
 * changes more times than this register value.
 */

#define UART_ACTIVE_THRESHOLD    0x000003ff
#define UART_ACTIVE_THRESHOLD_M  (UART_ACTIVE_THRESHOLD_V << UART_ACTIVE_THRESHOLD_S)
#define UART_ACTIVE_THRESHOLD_V  0x000003ff
#define UART_ACTIVE_THRESHOLD_S  0

/* UART_SWFC_CONF0_REG register
 * Software flow-control character configuration
 */

#define UART_SWFC_CONF0_REG (DR_REG_UART_BASE + 0x3c)

/* UART_XOFF_CHAR : R/W; bitpos: [17:10]; default: 19;
 * This register stores the Xoff flow control char.
 */

#define UART_XOFF_CHAR    0x000000ff
#define UART_XOFF_CHAR_M  (UART_XOFF_CHAR_V << UART_XOFF_CHAR_S)
#define UART_XOFF_CHAR_V  0x000000ff
#define UART_XOFF_CHAR_S  10

/* UART_XOFF_THRESHOLD : R/W; bitpos: [9:0]; default: 224;
 * When the data amount in Rx-FIFO is more than this register value with
 * uart_sw_flow_con_en set to 1, it will send a Xoff char.
 */

#define UART_XOFF_THRESHOLD    0x000003ff
#define UART_XOFF_THRESHOLD_M  (UART_XOFF_THRESHOLD_V << UART_XOFF_THRESHOLD_S)
#define UART_XOFF_THRESHOLD_V  0x000003ff
#define UART_XOFF_THRESHOLD_S  0

/* UART_SWFC_CONF1_REG register
 * Software flow-control character configuration
 */

#define UART_SWFC_CONF1_REG (DR_REG_UART_BASE + 0x40)

/* UART_XON_CHAR : R/W; bitpos: [17:10]; default: 17;
 * This register stores the Xon flow control char.
 */

#define UART_XON_CHAR    0x000000ff
#define UART_XON_CHAR_M  (UART_XON_CHAR_V << UART_XON_CHAR_S)
#define UART_XON_CHAR_V  0x000000ff
#define UART_XON_CHAR_S  10

/* UART_XON_THRESHOLD : R/W; bitpos: [9:0]; default: 0;
 * When the data amount in Rx-FIFO is less than this register value with
 * uart_sw_flow_con_en set to 1, it will send a Xon char.
 */

#define UART_XON_THRESHOLD    0x000003ff
#define UART_XON_THRESHOLD_M  (UART_XON_THRESHOLD_V << UART_XON_THRESHOLD_S)
#define UART_XON_THRESHOLD_V  0x000003ff
#define UART_XON_THRESHOLD_S  0

/* UART_TXBRK_CONF_REG register
 * Tx Break character configuration
 */

#define UART_TXBRK_CONF_REG (DR_REG_UART_BASE + 0x44)

/* UART_TX_BRK_NUM : R/W; bitpos: [7:0]; default: 10;
 * This register is used to configure the number of 0 to be sent after the
 * process of sending data is done. It is active when txd_brk is set to 1.
 */

#define UART_TX_BRK_NUM    0x000000ff
#define UART_TX_BRK_NUM_M  (UART_TX_BRK_NUM_V << UART_TX_BRK_NUM_S)
#define UART_TX_BRK_NUM_V  0x000000ff
#define UART_TX_BRK_NUM_S  0

