apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_uart.h
#define UART_RX_TOUT_THRHD    0x000003ff
#define UART_RX_TOUT_THRHD_M  (UART_RX_TOUT_THRHD_V << UART_RX_TOUT_THRHD_S)
#define UART_RX_TOUT_THRHD_V  0x000003ff
#define UART_RX_TOUT_THRHD_S  17

/* UART_RX_FLOW_THRHD : R/W; bitpos: [16:7]; default: 0;
 * This register is used to configure the maximum amount of data that can be
 * received  when hardware flow control works.
 */

#define UART_RX_FLOW_THRHD    0x000003ff
#define UART_RX_FLOW_THRHD_M  (UART_RX_FLOW_THRHD_V << UART_RX_FLOW_THRHD_S)
#define UART_RX_FLOW_THRHD_V  0x000003ff
#define UART_RX_FLOW_THRHD_S  7

/* UART_TX_SIZE : R/W; bitpos: [6:4]; default: 1;
 * This register is used to configure the amount of mem allocated for
 * transmit-FIFO. The default number is 128 bytes.
 */

#define UART_TX_SIZE    0x00000007
#define UART_TX_SIZE_M  (UART_TX_SIZE_V << UART_TX_SIZE_S)
#define UART_TX_SIZE_V  0x00000007
#define UART_TX_SIZE_S  4

/* UART_RX_SIZE : R/W; bitpos: [3:1]; default: 1;
 * This register is used to configure the amount of mem allocated for
 * receive-FIFO. The default number is 128 bytes.
 */

#define UART_RX_SIZE    0x00000007
#define UART_RX_SIZE_M  (UART_RX_SIZE_V << UART_RX_SIZE_S)
#define UART_RX_SIZE_V  0x00000007
#define UART_RX_SIZE_S  1

/* UART_MEM_TX_STATUS_REG register
 * Tx-FIFO write and read offset address.
 */

#define UART_MEM_TX_STATUS_REG (DR_REG_UART_BASE + 0x64)

/* UART_TX_RADDR : RO; bitpos: [20:11]; default: 0;
 * This register stores the offset address in Tx-FIFO when Tx-FSM reads data
 * via Tx-FIFO_Ctrl.
 */

#define UART_TX_RADDR    0x000003ff
#define UART_TX_RADDR_M  (UART_TX_RADDR_V << UART_TX_RADDR_S)
#define UART_TX_RADDR_V  0x000003ff
#define UART_TX_RADDR_S  11

/* UART_APB_TX_WADDR : RO; bitpos: [9:0]; default: 0;
 * This register stores the offset address in Tx-FIFO when software writes
 * Tx-FIFO via APB.
 */

#define UART_APB_TX_WADDR    0x000003ff
#define UART_APB_TX_WADDR_M  (UART_APB_TX_WADDR_V << UART_APB_TX_WADDR_S)
#define UART_APB_TX_WADDR_V  0x000003ff
#define UART_APB_TX_WADDR_S  0

/* UART_MEM_RX_STATUS_REG register
 * Rx-FIFO write and read offset address.
 */

#define UART_MEM_RX_STATUS_REG (DR_REG_UART_BASE + 0x68)

/* UART_RX_WADDR : RO; bitpos: [20:11]; default: 512;
 * This register stores the offset address in Rx-FIFO when Rx-FIFO_Ctrl
 * writes Rx-FIFO. UART0 is 10'h200. UART1 is 10'h280. UART2 is 10'h300.
 */

#define UART_RX_WADDR    0x000003ff
#define UART_RX_WADDR_M  (UART_RX_WADDR_V << UART_RX_WADDR_S)
#define UART_RX_WADDR_V  0x000003ff
#define UART_RX_WADDR_S  11

/* UART_APB_RX_RADDR : RO; bitpos: [9:0]; default: 512;
 * This register stores the offset address in RX-FIFO when software reads
 * data from Rx-FIFO via APB. UART0 is 10'h200. UART1 is 10'h280. UART2 is
 * 10'h300.
 */

#define UART_APB_RX_RADDR    0x000003ff
#define UART_APB_RX_RADDR_M  (UART_APB_RX_RADDR_V << UART_APB_RX_RADDR_S)
#define UART_APB_RX_RADDR_V  0x000003ff
#define UART_APB_RX_RADDR_S  0

/* UART_FSM_STATUS_REG register
 * UART transmit and receive status.
 */

#define UART_FSM_STATUS_REG (DR_REG_UART_BASE + 0x6c)

/* UART_ST_UTX_OUT : RO; bitpos: [7:4]; default: 0;
 * This is the status register of transmitter.
 */

#define UART_ST_UTX_OUT    0x0000000f
#define UART_ST_UTX_OUT_M  (UART_ST_UTX_OUT_V << UART_ST_UTX_OUT_S)
#define UART_ST_UTX_OUT_V  0x0000000f
#define UART_ST_UTX_OUT_S  4

/* UART_ST_URX_OUT : RO; bitpos: [3:0]; default: 0;
 * This is the status register of receiver.
 */

#define UART_ST_URX_OUT    0x0000000f
#define UART_ST_URX_OUT_M  (UART_ST_URX_OUT_V << UART_ST_URX_OUT_S)
#define UART_ST_URX_OUT_V  0x0000000f
#define UART_ST_URX_OUT_S  0

/* UART_POSPULSE_REG register
 * Autobaud high pulse register
 */

#define UART_POSPULSE_REG (DR_REG_UART_BASE + 0x70)

/* UART_POSEDGE_MIN_CNT : RO; bitpos: [11:0]; default: 4095;
 * This register stores the minimal input clock count between two positive
 * edges. It is used in boudrate-detect process.
 */

#define UART_POSEDGE_MIN_CNT    0x00000fff
#define UART_POSEDGE_MIN_CNT_M  (UART_POSEDGE_MIN_CNT_V << UART_POSEDGE_MIN_CNT_S)
#define UART_POSEDGE_MIN_CNT_V  0x00000fff
#define UART_POSEDGE_MIN_CNT_S  0

/* UART_NEGPULSE_REG register
 * Autobaud low pulse register
 */

#define UART_NEGPULSE_REG (DR_REG_UART_BASE + 0x74)

/* UART_NEGEDGE_MIN_CNT : RO; bitpos: [11:0]; default: 4095;
 * This register stores the minimal input clock count between two negative
 * edges. It is used in boudrate-detect process.
 */

#define UART_NEGEDGE_MIN_CNT    0x00000fff
#define UART_NEGEDGE_MIN_CNT_M  (UART_NEGEDGE_MIN_CNT_V << UART_NEGEDGE_MIN_CNT_S)
#define UART_NEGEDGE_MIN_CNT_V  0x00000fff
#define UART_NEGEDGE_MIN_CNT_S  0

/* UART_CLK_CONF_REG register
 * UART core clock configuration
 */

#define UART_CLK_CONF_REG(i) (REG_UART_BASE(i) + 0x78)

/* UART_RX_RST_CORE : R/W; bitpos: [27]; default: 0;
 * Write 1 then write 0 to this bit, reset UART Rx.
 */

#define UART_RX_RST_CORE    (BIT(27))
#define UART_RX_RST_CORE_M  (UART_RX_RST_CORE_V << UART_RX_RST_CORE_S)
#define UART_RX_RST_CORE_V  0x00000001
#define UART_RX_RST_CORE_S  27

/* UART_TX_RST_CORE : R/W; bitpos: [26]; default: 0;
 * Write 1 then write 0 to this bit, reset UART Tx.
 */

#define UART_TX_RST_CORE    (BIT(26))
#define UART_TX_RST_CORE_M  (UART_TX_RST_CORE_V << UART_TX_RST_CORE_S)
#define UART_TX_RST_CORE_V  0x00000001
#define UART_TX_RST_CORE_S  26

/* UART_RX_SCLK_EN : R/W; bitpos: [25]; default: 1;
 * Set this bit to enable UART Rx clock.
 */

#define UART_RX_SCLK_EN    (BIT(25))
#define UART_RX_SCLK_EN_M  (UART_RX_SCLK_EN_V << UART_RX_SCLK_EN_S)
#define UART_RX_SCLK_EN_V  0x00000001
#define UART_RX_SCLK_EN_S  25

/* UART_TX_SCLK_EN : R/W; bitpos: [24]; default: 1;
 * Set this bit to enable UART Tx clock.
 */

#define UART_TX_SCLK_EN    (BIT(24))
#define UART_TX_SCLK_EN_M  (UART_TX_SCLK_EN_V << UART_TX_SCLK_EN_S)
#define UART_TX_SCLK_EN_V  0x00000001
#define UART_TX_SCLK_EN_S  24

/* UART_RST_CORE : R/W; bitpos: [23]; default: 0;
 * Write 1 then write 0 to this bit, reset UART Tx/Rx.
 */

