apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_uart.h
#define UART_RST_CORE    (BIT(23))
#define UART_RST_CORE_M  (UART_RST_CORE_V << UART_RST_CORE_S)
#define UART_RST_CORE_V  0x00000001
#define UART_RST_CORE_S  23

/* UART_SCLK_EN : R/W; bitpos: [22]; default: 1;
 * Set this bit to enable UART Tx/Rx clock.
 */

#define UART_SCLK_EN    (BIT(22))
#define UART_SCLK_EN_M  (UART_SCLK_EN_V << UART_SCLK_EN_S)
#define UART_SCLK_EN_V  0x00000001
#define UART_SCLK_EN_S  22

/* UART_SCLK_SEL : R/W; bitpos: [21:20]; default: 3;
 * UART clock source select. 1: 80Mhz, 2: 8Mhz, 3: XTAL.
 */

#define UART_SCLK_SEL    0x00000003
#define UART_SCLK_SEL_M  (UART_SCLK_SEL_V << UART_SCLK_SEL_S)
#define UART_SCLK_SEL_V  0x00000003
#define UART_SCLK_SEL_S  20

/* UART_SCLK_DIV_NUM : R/W; bitpos: [19:12]; default: 1;
 * The integral part of the frequency divider factor.
 */

#define UART_SCLK_DIV_NUM    0x000000ff
#define UART_SCLK_DIV_NUM_M  (UART_SCLK_DIV_NUM_V << UART_SCLK_DIV_NUM_S)
#define UART_SCLK_DIV_NUM_V  0x000000ff
#define UART_SCLK_DIV_NUM_S  12

/* UART_SCLK_DIV_A : R/W; bitpos: [11:6]; default: 0;
 * The numerator of the frequency divider factor.
 */

#define UART_SCLK_DIV_A    0x0000003f
#define UART_SCLK_DIV_A_M  (UART_SCLK_DIV_A_V << UART_SCLK_DIV_A_S)
#define UART_SCLK_DIV_A_V  0x0000003f
#define UART_SCLK_DIV_A_S  6

/* UART_SCLK_DIV_B : R/W; bitpos: [5:0]; default: 0;
 * The  denominator of the frequency divider factor.
 */

#define UART_SCLK_DIV_B    0x0000003f
#define UART_SCLK_DIV_B_M  (UART_SCLK_DIV_B_V << UART_SCLK_DIV_B_S)
#define UART_SCLK_DIV_B_V  0x0000003f
#define UART_SCLK_DIV_B_S  0

/* UART_DATE_REG register
 * UART Version register
 */

#define UART_DATE_REG (DR_REG_UART_BASE + 0x7c)

/* UART_DATE : R/W; bitpos: [31:0]; default: 33587824;
 * This is the version register.
 */

#define UART_DATE    0xffffffff
#define UART_DATE_M  (UART_DATE_V << UART_DATE_S)
#define UART_DATE_V  0xffffffff
#define UART_DATE_S  0

/* UART_ID_REG register
 * UART ID register
 */

#define UART_ID_REG (DR_REG_UART_BASE + 0x80)

/* UART_REG_UPDATE : R/W/SC; bitpos: [31]; default: 0;
 * Software write 1 would synchronize registers into UART Core clock domain
 * and would be cleared by hardware after synchronization is done.
 */

#define UART_REG_UPDATE    (BIT(31))
#define UART_REG_UPDATE_M  (UART_REG_UPDATE_V << UART_REG_UPDATE_S)
#define UART_REG_UPDATE_V  0x00000001
#define UART_REG_UPDATE_S  31

/* UART_HIGH_SPEED : R/W; bitpos: [30]; default: 1;
 * This bit used to select synchronize mode. 1: Registers are auto
 * synchronized into UART Core clock and UART core should be keep the same
 * with APB clock. 0: After configure registers, software needs to write 1
 * to UART_REG_UPDATE to synchronize registers.
 */

#define UART_HIGH_SPEED    (BIT(30))
#define UART_HIGH_SPEED_M  (UART_HIGH_SPEED_V << UART_HIGH_SPEED_S)
#define UART_HIGH_SPEED_V  0x00000001
#define UART_HIGH_SPEED_S  30

/* UART_ID : R/W; bitpos: [29:0]; default: 1280;
 * This register is used to configure the uart_id.
 */

#define UART_ID    0x3fffffff
#define UART_ID_M  (UART_ID_V << UART_ID_S)
#define UART_ID_V  0x3fffffff
#define UART_ID_S  0

#endif /* __ARCH_XTENSA_SRC_ESP32S3_HARDWARE_ESP32S3_UART_H */
